// questions.js

const allQuestions = {
    L1: {
        A: [
            {
                question: "كم عدد آيات سورة الحديد؟",
                options: ["29 آية", "30 آية", "28 آية", "27 آية"],
                answer: 0
            },
            {
                question: "سورة الحديد هي سورة؟",
                options: ["سورة مكية", "سورة مدنية"],
                answer: 1
            },
            {
                question: "ما معنى 'سبح لله'؟",
                options: ["تغمد الله بالرحمة", "نزّه الله ومجدّه ودل عليه", "خضع لله بالصلاة", "ساهم الله في الرزق"],
                answer: 1
            },
            {
                question: "ما معنى 'الأول'؟",
                options: ["اللاحق بعد كل شيء", "الموجود في المستقبل", "السابق على جميع الموجودات", "الذي يأتي في النهاية"],
                answer: 2
            },
            {
                question: "ما معنى 'الأخر'؟",
                options: ["الذي يأتي بعد كل شيء", "الباقي بعد فنائنا", "الأول في الزمان", "الذي لا يتغير"],
                answer: 1
            },
            {
                question: "ما المقصود بـ 'ما يلج'؟",
                options: ["ما يخرج من الأرض", "ما يدخل من مطر وغيره", "ما يختفي في الظلام", "ما يسقط من السماء"],
                answer: 1
            },
            {
                question: "ما معنى 'ما يعرج فيها'؟",
                options: ["ما يهبط منها", "ما يصعد إليها من الملائكة والأعمال", "ما يدخل منها", "ما يمر عبرها"],
                answer: 1
            },
            {
                question: "ماذا يعني 'قبل الفتح'؟",
                options: ["قبل وقوع الحرب", "قبل فتح مكة أو صلح الحديبية", "قبل بدء الهجرة", "قبل نزول الوحي"],
                answer: 1
            },
            {
                question: "ما معنى 'قرضاً حسناً'؟",
                options: ["قرض بفائدة قليلة", "قرض مجاني", "قرض محتسب له", "قرض مع تقديم المساعدة"],
                answer: 2
            },
            {
                question: "ما معنى 'نقتبس'؟",
                options: ["نأخذ ونستخدم", "نرمي ونبتعد", "نبحث ونفحص", "نصبّ ونأخذ ونستضيئ"],
                answer: 3
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ],
        B: [
            {
                question: "ماذا يعني 'الم يأن'؟",
                options: ["هل وصل", "هل بدأ", "هل انتهى", "الم يجيء"],
                answer: 3
            },
            {
                question: "ما معنى 'الأمد'؟",
                options: ["المسافة", "الأجل أو الزمان", "الجغرافيا", "الطريقة"],
                answer: 1
            },
            {
                question: "ما المقصود بـ 'يهيج'؟",
                options: ["يندفع بسرعة", "ييبس بأقصى غايته", "ينمو تدريجياً", "يتدفق"],
                answer: 1
            },
            {
                question: "ماذا يعني 'يكون حطاماً'؟",
                options: ["يصبح طعاماً", "يصبح فتاتاً هشيمًا متكسراً بعد يبسه", "يصبح مشتعلاً", "يصبح لامعاً"],
                answer: 1
            },
            {
                question: "ما معنى 'نبرأها'؟",
                options: ["ننقذها", "نخلق هذه الكائنات", "نزرعها", "ننقلها"],
                answer: 1
            },
            {
                question: "ماذا يعني 'مختال فخور'؟",
                options: ["متواضع ومهذب", "متكبر ومباهٍ متطاول بما أوتي", "حزين ومكتئب", "خائف ومتردد"],
                answer: 1
            },
            {
                question: "ما معنى 'باس شديد'؟",
                options: ["قوة ضعيفة", "ضعف شديد", "قوة شديدة", "عزم قليل"],
                answer: 2
            },
            {
                question: "ماذا يعني 'قفينا على آثارهم'؟",
                options: ["تقابلنا معهم", "بدأنا معهم", "أتبعناهم وبعثنا بعدهم", "انفصلنا عنهم"],
                answer: 2
            },
            {
                question: "ما معنى 'رهبانية'؟",
                options: ["ترف في المعيشة", "مغالات في التعبد والتقشف", "انغماس في الدنيا", "التمتع بالحياة"],
                answer: 1
            },
            {
                question: "كم عدد آيات سورة الحديد؟",
                options: ["29 آية", "30 آية", "28 آية", "27 آية"],
                answer: 0
            },
            {
                question: "ما هو السبب الرئيسي للهجرة النبوية؟",
                options: ["التجارة", "التعليم", "الدعوة", "السفر"],
                answer: 2
            },
            {
                question: "ما هو اسم الوثيقة التي وضعها النبي صلى الله عليه وسلم كنظام للحكم في المدينة؟",
                options: ["ميثاق مكة", "صحيفة المدينة", "دستور قباه", "المسجد النبوي"],
                answer: 1
            },
            {
                question: "ماذا فعل علي بن أبي طالب في الهجرة؟",
                options: ["كان دليل الرحلة", "تسليم الودائع", "احضار الطعام", "السفر أولاً"],
                answer: 1
            },
            {
                question: "من هو الشخص الذي أعد الراحلتين للهجرة؟",
                options: ["علي بن أبي طالب", "عبدالله بن أبي بكر", "حمزة بن عبد المطلب", "أبو بكر الصديق"],
                answer: 3
            },
            {
                question: "ما هو دور عبدالله بن أريقط في الهجرة؟",
                options: ["توفير الطعام", "توفير المأوى", "دليل الرحلة", "حماية النبي"],
                answer: 2
            }
        ],
        C: [
            {
                question: "ما معنى 'الأول'؟",
                options: ["اللاحق بعد كل شيء", "الموجود في المستقبل", "السابق على جميع الموجودات", "الذي يأتي في النهاية"],
                answer: 2
            },
            {
                question: "ما معنى 'الأخر'؟",
                options: ["الذي يأتي بعد كل شيء", "الباقي بعد فنائنا", "الأول في الزمان", "الذي لا يتغير"],
                answer: 1
            },
            {
                question: "ما المقصود بـ 'ما يلج'؟",
                options: ["ما يخرج من الأرض", "ما يدخل من مطر وغيره", "ما يختفي في الظلام", "ما يسقط من السماء"],
                answer: 1
            },
            {
                question: "ما معنى 'ما يعرج فيها'؟",
                options: ["ما يهبط منها", "ما يصعد إليها من الملائكة والأعمال", "ما يدخل منها", "ما يمر عبرها"],
                answer: 1
            },
            {
                question: "ماذا يعني 'قبل الفتح'؟",
                options: ["قبل وقوع الحرب", "قبل فتح مكة أو صلح الحديبية", "قبل بدء الهجرة", "قبل نزول الوحي"],
                answer: 1
            },
            {
                question: "ما معنى 'قرضاً حسناً'؟",
                options: ["قرض بفائدة قليلة", "قرض مجاني", "قرض محتسب له", "قرض مع تقديم المساعدة"],
                answer: 2
            },
            {
                question: "ما معنى 'نقتبس'؟",
                options: ["نأخذ ونستخدم", "نرمي ونبتعد", "نبحث ونفحص", "نصبّ ونأخذ ونستضيئ"],
                answer: 3
            },
            {
                question: "ماذا يعني 'الم يأن'؟",
                options: ["هل وصل", "هل بدأ", "هل انتهى", "الم يجيء"],
                answer: 3
            },
            {
                question: "ما معنى 'الأمد'؟",
                options: ["المسافة", "الأجل أو الزمان", "الجغرافيا", "الطريقة"],
                answer: 1
            },
            {
                question: "ماذا يعني 'مختال فخور'؟",
                options: ["متواضع ومهذب", "متكبر ومباهٍ متطاول بما أوتي", "حزين ومكتئب", "خائف ومتردد"],
                answer: 1
            },
            {
                question: "من هو صاحب المخابرات الصادق؟",
                options: ["علي بن أبي طالب", "حمزة بن عبد المطلب", "عبدالله بن أبي بكر", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "كيف استقبل النبي صلى الله عليه وسلم في المدينة؟",
                options: ["كسفير", "كلاجئ", "كمقاتل", "حاكما"],
                answer: 3
            },
            {
                question: "كانت الهجرة النبوية حدثًا غير مجرى التاريخ.",
                options: ["صح", "خطأ"],
                answer: 0
            },
            {
                question: "كان أبو بكر الصديق أول من أسلم من الرجال.",
                options: ["صح", "خطأ"],
                answer: 0
            },
            {
                question: "استعمل النبي صلى الله عليه وسلم علي بن أبي طالب لتسليم الودائع.",
                options: ["صح", "خطأ"],
                answer: 0
            }
        ]
    },
    L2: {
        A: [
            {
                question: "كم عدد آيات سورة الإنسان؟",
                options: ["29 آية", "30 آية", "31 آية", "32 آية"],
                answer: 2
            },
            {
                question: "ما هو أحد أسماء سورة الإنسان؟",
                options: ["سورة النمل", "سورة هل أتى", "سورة الرحمن", "سورة الإسراء"],
                answer: 1
            },
            {
                question: "ما هو الموضوع الرئيسي لسورة الإنسان؟",
                options: ["تعريف الإنسان بنفسه وتأكيد اختياره وتكليفه", "قصص الحيوانات", "تاريخ الأنبياء", "تشريعات الطهارة"],
                answer: 0
            },
            {
                question: "سورة الإنسان هي سورة؟",
                options: ["سورة مكية", "سورة مدنية"],
                answer: 0
            },
            {
                question: "ما معنى 'أمشاج'؟",
                options: ["ماء صافٍ", "هواء نقي", "أخلاط ممتزجة متباينة الصفات", "عناصر مفصولة"],
                answer: 2
            },
            {
                question: "ما معنى 'سلاسل'؟",
                options: ["سلاسل للزينة", "بها يقادون وفي النار يسحبون", "سلاسل للزراعة", "سلاسل للطعام"],
                answer: 1
            },
            {
                question: "ما معنى 'يفجرونها'؟",
                options: ["يضعونها في مكان آمن", "يهدئونها", "يخفونها بعيداً", "يجرونها حيث شاءوا من منازلهم"],
                answer: 3
            },
            {
                question: "ما معنى 'مستطيراً'؟",
                options: ["محدود الانتشار", "فاشياً منتشراً غاية الانتشار", "مزيلاً بالكامل", "متركزاً في مكان واحد"],
                answer: 1
            },
            {
                question: "ما معنى 'قمطريراً'؟",
                options: ["شديد العبوس", "سعيد ومبتهج", "لطيف وهادئ", "مملوء بالفرح"],
                answer: 0
            },
            {
                question: "ما معنى 'لقاهم نضرة'؟",
                options: ["أعطاهم حسناً وبهجة في الوجوه", "أعطاهم حزنًا", "أعطاهم غموضاً", "أعطاهم عتاباً"],
                answer: 0
            },
            {
                question: "ما هو السبب الرئيسي للهجرة النبوية؟",
                options: ["التجارة", "التعليم", "الدعوة", "السفر"],
                answer: 2
            },
            {
                question: "ما هو اسم الوثيقة التي وضعها النبي صلى الله عليه وسلم كنظام للحكم في المدينة؟",
                options: ["ميثاق مكة", "صحيفة المدينة", "دستور قباه", "المسجد النبوي"],
                answer: 1
            },
            {
                question: "ماذا فعل علي بن أبي طالب في الهجرة؟",
                options: ["كان دليل الرحلة", "تسليم الودائع", "احضار الطعام", "السفر أولاً"],
                answer: 1
            },
            {
                question: "من هو الشخص الذي أعد الراحلتين للهجرة؟",
                options: ["علي بن أبي طالب", "عبدالله بن أبي بكر", "حمزة بن عبد المطلب", "أبو بكر الصديق"],
                answer: 3
            },
            {
                question: "ما هو دور عبدالله بن أريقط في الهجرة؟",
                options: ["توفير الطعام", "توفير المأوى", "دليل الرحلة", "حماية النبي"],
                answer: 2
            }
        ],
        B: [
            {
                question: "ما معنى 'الآرائك'؟",
                options: ["غرف النوم", "أدوات الزينة", "الأسِرَّة في الحجال", "قوارير الماء"],
                answer: 2
            },
            {
                question: "ما معنى 'زمهريراً'؟",
                options: ["دفئاً معتدلاً", "رطوبة عالية", "حرارة معتدلة", "برداً شديداً"],
                answer: 3
            },
            {
                question: "ما معنى 'بكرة وأصيلاً'؟",
                options: ["أول الليل وآخره", "منتصف النهار", "أول النهار وآخره", "بداية العام ونهايته"],
                answer: 2
            },
            {
                question: "ما معنى 'قواريرا'؟",
                options: ["كالزجاجات في الصفاء", "زجاجات مكسورة", "قوارير عادية", "أكواب خشبية"],
                answer: 0
            },
            {
                question: "كم عدد آيات سورة الحديد؟",
                options: ["29 آية", "30 آية", "28 آية", "27 آية"],
                answer: 0
            },
            {
                question: "ما معنى 'سبح لله'؟",
                options: ["تغمد الله بالرحمة", "نزّه الله ومجدّه ودل عليه", "خضع لله بالصلاة", "ساهم الله في الرزق"],
                answer: 1
            },
            {
                question: "ما معنى 'الأول'؟",
                options: ["اللاحق بعد كل شيء", "الموجود في المستقبل", "السابق على جميع الموجودات", "الذي يأتي في النهاية"],
                answer: 2
            },
            {
                question: "ما معنى 'الأخر'؟",
                options: ["الذي يأتي بعد كل شيء", "الباقي بعد فنائنا", "الأول في الزمان", "الذي لا يتغير"],
                answer: 1
            },
            {
                question: "ما المقصود بـ 'ما يلج'؟",
                options: ["ما يخرج من الأرض", "ما يدخل من مطر وغيره", "ما يختفي في الظلام", "ما يسقط من السماء"],
                answer: 1
            },
            {
                question: "ما معنى 'ما يعرج فيها'؟",
                options: ["ما يهبط منها", "ما يصعد إليها من الملائكة والأعمال", "ما يدخل منها", "ما يمر عبرها"],
                answer: 1
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ],
        C: [
            {
                question: "ماذا يعني 'قبل الفتح'؟",
                options: ["قبل وقوع الحرب", "قبل فتح مكة أو صلح الحديبية", "قبل بدء الهجرة", "قبل نزول الوحي"],
                answer: 1
            },
            {
                question: "ما معنى 'قرضاً حسناً'؟",
                options: ["قرض بفائدة قليلة", "قرض مجاني", "قرض محتسب له", "قرض مع تقديم المساعدة"],
                answer: 2
            },
            {
                question: "ما معنى 'نقتبس'؟",
                options: ["نأخذ ونستخدم", "نرمي ونبتعد", "نبحث ونفحص", "نصبّ ونأخذ ونستضيئ"],
                answer: 3
            },
            {
                question: "ماذا يعني 'الم يأن'؟",
                options: ["هل وصل", "هل بدأ", "هل انتهى", "الم يجيء"],
                answer: 3
            },
            {
                question: "ما معنى 'الأمد'؟",
                options: ["المسافة", "الأجل أو الزمان", "الجغرافيا", "الطريقة"],
                answer: 1
            },
            {
                question: "ما معنى 'يهيج'؟",
                options: ["يندفع بسرعة", "ييبس بأقصى غايته", "ينمو تدريجياً", "يتدفق"],
                answer: 1
            },
            {
                question: "ماذا يعني 'يكون حطاماً'؟",
                options: ["يصبح طعاماً", "يصبح فتاتاً هشيمًا متكسراً بعد يبسه", "يصبح مشتعلاً", "يصبح لامعاً"],
                answer: 1
            },
            {
                question: "ما معنى 'نبرأها'؟",
                options: ["ننقذها", "نخلق هذه الكائنات", "نزرعها", "ننقلها"],
                answer: 1
            },
            {
                question: "ماذا يعني 'مختال فخور'؟",
                options: ["متواضع ومهذب", "متكبر ومباهٍ متطاول بما أوتي", "حزين ومكتئب", "خائف ومتردد"],
                answer: 1
            },
            {
                question: "ما معنى 'باس شديد'؟",
                options: ["قوة ضعيفة", "ضعف شديد", "قوة شديدة", "عزم قليل"],
                answer: 2
            },
            {
                question: "ما هو السبب الرئيسي للهجرة النبوية؟",
                options: ["التجارة", "التعليم", "الدعوة", "السفر"],
                answer: 2
            },
            {
                question: "ما هو اسم الوثيقة التي وضعها النبي صلى الله عليه وسلم كنظام للحكم في المدينة؟",
                options: ["ميثاق مكة", "صحيفة المدينة", "دستور قباه", "المسجد النبوي"],
                answer: 1
            },
            {
                question: "ماذا فعل علي بن أبي طالب في الهجرة؟",
                options: ["كان دليل الرحلة", "تسليم الودائع", "احضار الطعام", "السفر أولاً"],
                answer: 1
            },
            {
                question: "من هو الشخص الذي أعد الراحلتين للهجرة؟",
                options: ["علي بن أبي طالب", "عبدالله بن أبي بكر", "حمزة بن عبد المطلب", "أبو بكر الصديق"],
                answer: 3
            },
            {
                question: "ما هو دور عبدالله بن أريقط في الهجرة؟",
                options: ["توفير الطعام", "توفير المأوى", "دليل الرحلة", "حماية النبي"],
                answer: 2
            }
        ]
    },
    L3: {
        A: [
            {
                question: "كم عدد آيات سورة غافر؟",
                options: ["85 آية", "114 آية", "76 آية", "89 آية"],
                answer: 0
            },
            {
                question: "سورة غافر هي سورة؟",
                options: ["جميع آياتها مكية", "جميع آياتها مدنية", "مكية، الا الآيات 56 و57 في آيات مدنية", "مدنية، الا الآيات 56 و57 في آيات مكية"],
                answer: 2
            },
            {
                question: "سورة غافر تسمى أيضا بسورة؟",
                options: ["الكليم", "المؤمن", "قلب القرآن", "الملائكة"],
                answer: 1
            },
            {
                question: "ما معنى 'ذي الطول'؟",
                options: ["الغنى أو الإنعام والتفضل أو المن", "الضعف أو الفقر", "القوة البدنية", "الجهل"],
                answer: 0
            },
            {
                question: "ما معنى 'ليدحضوا به الحق'؟",
                options: ["ليبطلوا ويزيلوا بالباطل الحق", "ليظهروا الحق", "ليؤكدوا الحق", "ليدافعوا عن الحق"],
                answer: 0
            },
            {
                question: "ما معنى 'قَهم السيئات'؟",
                options: ["المعاصي أو عقوبتها", "الحسنات", "النصائح", "الطاعات"],
                answer: 0
            },
            {
                question: "ما معنى 'لمقت الله'؟",
                options: ["لبغضه لشديد وغضبه عليكم", "لحب الله", "لرحمة الله", "لرضا الله"],
                answer: 0
            },
            {
                question: "ما معنى 'يُنيب'؟",
                options: ["يرجع إلى التفكر في الآيات", "ينفصل عن التفكير", "يتجاهل الآيات", "يرفض النصائح"],
                answer: 0
            },
            {
                question: "ما معنى 'يوم التلاق'؟",
                options: ["يوم العمل", "يوم الاجتماع في المحشر", "يوم الولادة", "يوم الدراسة"],
                answer: 1
            },
            {
                question: "ما معنى 'يوم الأزفة'؟",
                options: ["يوم الرخاء", "يوم القيامة لقربها", "يوم الازدهار", "يوم السلام"],
                answer: 1
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ],
        B: [
            {
                question: "ما معنى 'حميم'؟",
                options: ["بعيد عابس", "قريب مشفق يهتم بهم", "غريب لا يهتم", "عدو حاقد"],
                answer: 1
            },
            {
                question: "ما معنى 'استحيوا نسائهم'؟",
                options: ["احترموا النساء", "استبقوا بناتهم للخدمة", "زوجوا بناتهم", "دعوا النساء للعمل"],
                answer: 1
            },
            {
                question: "ما معنى 'عُذت بربي'؟",
                options: ["طلبت المساعدة من الناس", "اعتصمت تحصنت بالله تعالى", "لجأت إلى الحكام", "استندت إلى قوتي الشخصية"],
                answer: 1
            },
            {
                question: "ما معنى 'يوم التناد'؟",
                options: ["يوم الولادة", "يوم العمل", "يوم القيامة", "يوم الفرح"],
                answer: 2
            },
            {
                question: "ما معنى 'مُرتاب'؟",
                options: ["مؤمن", "متأكد", "في دين الله شاك في وحدانيته", "مطمئن"],
                answer: 2
            },
            {
                question: "ما معنى 'بغير سلطان'؟",
                options: ["بوجود دعم", "بوجود دليل قوي", "بغير برهان وحجة", "بوجود شهود"],
                answer: 2
            },
            {
                question: "ما معنى 'صرحاً'؟",
                options: ["منزلاً", "سوراً", "قصراً", "حديقة"],
                answer: 2
            },
            {
                question: "ما معنى 'تباب'؟",
                options: ["تقدم وازدهار", "نجاح وازدهار", "خسران وهلاك", "استقرار وسلام"],
                answer: 2
            },
            {
                question: "ما معنى 'غُدواً وعشياً'؟",
                options: ["بعد المغرب", "ليلاً ونهاراً", "وقت الظهر", "صباحاً أو مساءً"],
                answer: 3
            },
            {
                question: "ما معنى 'داخرين'؟",
                options: ["مطمئنين ومؤكدين", "فائزين وسعداء", "أقوياء ومؤثرين", "صاغرين أذلاء"],
                answer: 3
            },
            {
                question: "ما هو السبب الرئيسي للهجرة النبوية؟",
                options: ["التجارة", "التعليم", "الدعوة", "السفر"],
                answer: 2
            },
            {
                question: "ما هو اسم الوثيقة التي وضعها النبي صلى الله عليه وسلم كنظام للحكم في المدينة؟",
                options: ["ميثاق مكة", "صحيفة المدينة", "دستور قباه", "المسجد النبوي"],
                answer: 1
            },
            {
                question: "ماذا فعل علي بن أبي طالب في الهجرة؟",
                options: ["كان دليل الرحلة", "تسليم الودائع", "احضار الطعام", "السفر أولاً"],
                answer: 1
            },
            {
                question: "من هو الشخص الذي أعد الراحلتين للهجرة؟",
                options: ["علي بن أبي طالب", "عبدالله بن أبي بكر", "حمزة بن عبد المطلب", "أبو بكر الصديق"],
                answer: 3
            },
            {
                question: "ما هو دور عبدالله بن أريقط في الهجرة؟",
                options: ["توفير الطعام", "توفير المأوى", "دليل الرحلة", "حماية النبي"],
                answer: 2
            }
        ],
        C: [
            {
                question: "ما معنى 'يؤفك'؟",
                options: ["يشجع على العبادة", "يوجه إلى الحق", "يعزز الإيمان", "يصرف عن التوحيد الحق"],
                answer: 3
            },
            {
                question: "ما معنى 'الأغلال'؟",
                options: ["الزخارف الفنية", "الحماية الأمنية", "الملابس الثقيلة", "القيود التي تجمع الأيدي إلى الأعناق"],
                answer: 3
            },
            {
                question: "كم عدد آيات سورة غافر؟",
                options: ["85 آية", "114 آية", "76 آية", "89 آية"],
                answer: 0
            },
            {
                question: "ما معنى 'ذي الطول'؟",
                options: ["الغنى أو الإنعام والتفضل أو المن", "الضعف أو الفقر", "القوة البدنية", "الجهل"],
                answer: 0
            },
            {
                question: "ما معنى 'قَهم السيئات'؟",
                options: ["المعاصي أو عقوبتها", "الحسنات", "النصائح", "الطاعات"],
                answer: 0
            },
            {
                question: "ما معنى 'يُنيب'؟",
                options: ["يرجع إلى التفكر في الآيات", "ينفصل عن التفكير", "يتجاهل الآيات", "يرفض النصائح"],
                answer: 0
            },
            {
                question: "ما معنى 'يوم التلاق'؟",
                options: ["يوم العمل", "يوم الاجتماع في المحشر", "يوم الولادة", "يوم الدراسة"],
                answer: 1
            },
            {
                question: "ما معنى 'يوم الأزفة'؟",
                options: ["يوم الرخاء", "يوم القيامة لقربها", "يوم الازدهار", "يوم السلام"],
                answer: 1
            },
            {
                question: "ما معنى 'حميم'؟",
                options: ["بعيد عابس", "قريب مشفق يهتم بهم", "غريب لا يهتم", "عدو حاقد"],
                answer: 1
            },
            {
                question: "ما معنى 'استحيوا نسائهم'؟",
                options: ["احترموا النساء", "استبقوا بناتهم للخدمة", "زوجوا بناتهم", "دعوا النساء للعمل"],
                answer: 1
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ]
    },
    L4: {
        A: [
            {
                question: "كم عدد آيات سورة النمل؟",
                options: ["91 آية", "92 آية", "93 آية", "94 آية"],
                answer: 2
            },
            {
                question: "هل لسورة النمل سبب نزول محدد؟",
                options: ["لا، هي من جملة ما نزل من السور المكية", "نعم، بسبب حادثة خاصة", "نعم", "نعم، بسبب نزول الوحي على النبي محمد"],
                answer: 0
            },
            {
                question: "ما هي بعض القصص التي تحتويها سورة النمل؟",
                options: ["قصة نبي الله موسى عليه السلام مع فرعون الطاغية", "قصة أنبياء الله داوود وسليمان عليهما السلام مع جنده وملكة سبأ", "قصة نبي الله صالح عليه السلام مع قومه", "جميع ما ذكر"],
                answer: 3
            },
            {
                question: "ما معنى 'أنست ناراً'؟",
                options: ["أبصرتها إبصارا بينًا", "شعرت بالخوف منها", "أعجبتني", "أطفأتها"],
                answer: 0
            },
            {
                question: "ما معنى 'بشهاب قبس'؟",
                options: ["بشعلة نار ساطعة مقبوسة من أصلها", "بنجمة لامعة", "بريح قوية", "ببرق"],
                answer: 0
            },
            {
                question: "ما معنى 'لم يعقب'؟",
                options: ["لم يرجع على عقبه أو لم يلتفت", "لم يتبع", "لم يحترم", "لم ينتظر"],
                answer: 0
            },
            {
                question: "ما معنى 'لا يحطمنكم'؟",
                options: ["لا يكسرنكم ويهلكنكم", "لا يضربكم", "لا يطردكم", "لا يعبث بكم"],
                answer: 0
            },
            {
                question: "ما معنى 'يخرج الخبأ'؟",
                options: ["يظهر المخبوء المستور أيًا كان", "يخفي السر", "يخبئ المعلومات", "ينقلب على الشخص"],
                answer: 0
            },
            {
                question: "ما معنى 'لا قبل لهم به'؟",
                options: ["لا يهتمون به", "لا طاقة لهم بمقاومتها", "لا يعترفون به", "لا يفهمون"],
                answer: 1
            },
            {
                question: "ما معنى 'هم صاغرون'؟",
                options: ["شجعان", "ذليلون بالأسر والاستعباد", "مهتمون", "أقوياء"],
                answer: 1
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ],
        B: [
            {
                question: "ما معنى 'طرفك'؟",
                options: ["قلبك", "نظرك أو جفن عينك بعد فتحه", "ذراعك", "لسانك"],
                answer: 1
            },
            {
                question: "ما معنى 'نكّروا'؟",
                options: ["أكدوا", "غيروا", "تركوا", "احتفظوا"],
                answer: 1
            },
            {
                question: "ما معنى 'حسبته لجّة'؟",
                options: ["اعتقدت أنه نار", "ظننته ماء غزيراً", "رأيته دخاناً", "تخيلته رعداً"],
                answer: 1
            },
            {
                question: "ما معنى 'اطّيرنا'؟",
                options: ["تفائلنا", "تعجبنا", "تشائمنا", "تسرعنا"],
                answer: 2
            },
            {
                question: "ما معنى 'طائركم عند الله'؟",
                options: ["حسناتكم", "صلاتكم", "شؤمكم وعملكم مكتوب عليكم عنده تعالى", "أعمالكم"],
                answer: 2
            },
            {
                question: "ما معنى 'تقاسموات بالله'؟",
                options: ["اتفقوا على خير", "أقسموا بالله", "تحالفوا بالله أو احلفوا به", "اختلفوا بشأن"],
                answer: 2
            },
            {
                question: "ما معنى 'لنبيتنه واهله'؟",
                options: ["لنحترمهم دائماً", "لنطردهم نهاراً", "لنقتلهم ليلاً بغتة", "لنساعدهم"],
                answer: 2
            },
            {
                question: "ما معنى 'من الغابرين'؟",
                options: ["من المتأخرين في الزمن", "من المتقدمين في الفهم", "بجعلها من الباقين من العذاب", "من الأموات"],
                answer: 2
            },
            {
                question: "ما معنى 'قوم عدون'؟",
                options: ["يهتمون بالعدل", "يتبعون الحق", "يلتزمون بالقوانين", "ينحرفون عن الحق إلى الباطل"],
                answer: 3
            },
            {
                question: "ما معنى 'عمون'؟",
                options: ["دققوا في التفاصيل", "زادوا في النور", "فهموا الدلائل", "عمي البصائر عن دلائلها البينة"],
                answer: 3
            },
            {
                question: "ما هو السبب الرئيسي للهجرة النبوية؟",
                options: ["التجارة", "التعليم", "الدعوة", "السفر"],
                answer: 2
            },
            {
                question: "ما هو اسم الوثيقة التي وضعها النبي صلى الله عليه وسلم كنظام للحكم في المدينة؟",
                options: ["ميثاق مكة", "صحيفة المدينة", "دستور قباه", "المسجد النبوي"],
                answer: 1
            },
            {
                question: "ماذا فعل علي بن أبي طالب في الهجرة؟",
                options: ["كان دليل الرحلة", "تسليم الودائع", "احضار الطعام", "السفر أولاً"],
                answer: 1
            },
            {
                question: "من هو الشخص الذي أعد الراحلتين للهجرة؟",
                options: ["علي بن أبي طالب", "عبدالله بن أبي بكر", "حمزة بن عبد المطلب", "أبو بكر الصديق"],
                answer: 3
            },
            {
                question: "ما هو دور عبدالله بن أريقط في الهجرة؟",
                options: ["توفير الطعام", "توفير المأوى", "دليل الرحلة", "حماية النبي"],
                answer: 2
            }
        ],
        C: [
            {
                question: "ما معنى 'أساطير الأولين'؟",
                options: ["قصصهم الواقعية", "كتبهم المقدسة", "حقائقهم العلمية", "أكاذيبهم المسطرة في كتبهم"],
                answer: 3
            },
            {
                question: "ما معنى 'ردف لكم'؟",
                options: ["اعتذر لكم", "ترككم", "استقبلكم", "لحقكم ووصل إليكم"],
                answer: 3
            },
            {
                question: "ما معنى 'داخرين'؟",
                options: ["متفائلين بعد البعث", "أقوياء بعد البعث", "سعداء بعد البعث", "صاغرين أذلاء بعد البعث"],
                answer: 3
            },
            {
                question: "ما معنى 'فكبّت وجوههم'؟",
                options: ["شعروا بالسعادة", "رفعوا رؤوسهم", "أحيوا أملهم", "ألقوا منكوسين"],
                answer: 3
            },
            {
                question: "كم عدد آيات سورة النمل؟",
                options: ["91 آية", "92 آية", "93 آية", "94 آية"],
                answer: 2
            },
            {
                question: "هل لسورة النمل سبب نزول محدد؟",
                options: ["لا، هي من جملة ما نزل من السور المكية", "نعم، بسبب حادثة خاصة", "نعم", "نعم، بسبب نزول الوحي على النبي محمد"],
                answer: 0
            },
            {
                question: "ما هي بعض القصص التي تحتويها سورة النمل؟",
                options: ["قصة نبي الله موسى عليه السلام مع فرعون الطاغية", "قصة أنبياء الله داوود وسليمان عليهما السلام مع جنده وملكة سبأ", "قصة نبي الله صالح عليه السلام مع قومه", "جميع ما ذكر"],
                answer: 3
            },
            {
                question: "ما معنى 'أنست ناراً'؟",
                options: ["أبصرتها إبصارا بينًا", "شعرت بالخوف منها", "أعجبتني", "أطفأتها"],
                answer: 0
            },
            {
                question: "ما معنى 'بشهاب قبس'؟",
                options: ["بشعلة نار ساطعة مقبوسة من أصلها", "بنجمة لامعة", "بريح قوية", "ببرق"],
                answer: 0
            },
            {
                question: "ما معنى 'لم يعقب'؟",
                options: ["لم يرجع على عقبه أو لم يلتفت", "لم يتبع", "لم يحترم", "لم ينتظر"],
                answer: 0
            },
            {
                question: "من كان صاحِب رسول الله صلى الله عليه وسلم في الهجرة؟",
                options: ["عمر بن الخطاب", "علي بن أبي طالب", "أبو بكر الصديق", "عثمان بن عفان"],
                answer: 2
            },
            {
                question: "من هو الشخص الذي كان يُخبِر رسول الله وصاحِبَهُ عن تحركات العدو؟",
                options: ["عبدالله بن أبي بكر", "علي بن أبي طالب", "حمزة بن عبد المطلب", "خالد بن الوليد"],
                answer: 0
            },
            {
                question: "من كان دليل الهجرة وخبير الصحراء؟",
                options: ["حمزة بن عبد المطلب", "عبدالله بن أريقط", "بلال بن رباح", "أبو ذر الغفاري"],
                answer: 1
            },
            {
                question: "ماذا كان رد رسول الله صلى الله عليه وسلم عندما قال أبو بكر 'لو أن أحدهم نظر تحت قدميه لأبصرنا'؟",
                options: ["الخوف", "ما ظنك يا أبا بكر باثنين الله ثالثهما", "الهروب", "التسليم"],
                answer: 1
            },
            {
                question: "ما هو العمل الذي كان يقوم به عبدالله بن أريقط أثناء الهجرة؟",
                options: ["حارس", "دليل", "جاسوس", "قائد"],
                answer: 1
            }
        ]
    }
};

// Retrieve the student level from localStorage
var studentLevel = localStorage.getItem('studentlevel');
console.log("Student Level:", studentLevel);

if (studentLevel && allQuestions[studentLevel]) {
    // Randomly select one form (A, B, or C)
    const forms = ['A', 'B', 'C'];
    const selectedFormKey = forms[Math.floor(Math.random() * forms.length)];
    const selectedForm = allQuestions[studentLevel][selectedFormKey];
    console.log("Selected Form:", selectedForm);
    localStorage.setItem("selectedForm", selectedFormKey);
    localStorage.setItem("questions", JSON.stringify(selectedForm));
} else {
    console.error('Invalid or missing student level:', studentLevel);
}
